{
  "backend/main.mo": "Defines user, trip, diamond, payout types with sorting utilities and manages state for users, trips, diamonds, earnings, and payouts with access control.",
  "feature_evidence.json": "Lists features, related source files, components, and test IDs for diamond assessment, verification, buyer connections, and UI branding updates.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of all frontend source files including authentication, dashboard, trips, payouts, diamonds, and layout components.",
  "frontend/index.css": "Defines global Tailwind CSS variables and theme tokens for light and dark modes with OKLCH color values.",
  "frontend/index.html": "Base HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Main React component handling authentication flow, profile setup, and routing into the dashboard within the app layout.",
  "frontend/src/components/auth/AuthWelcome.tsx": "Unauthenticated landing page with branding, diamond imagery, feature descriptions, and Internet Identity login button.",
  "frontend/src/components/auth/LoginButton.tsx": "Reusable login/logout button using Internet Identity with loading states and query cache clearing.",
  "frontend/src/components/buyers/BuyersPanel.tsx": "Displays a list of buyer platforms fetched from the API with links and guidance for contacting buyers.",
  "frontend/src/components/dashboard/Dashboard.tsx": "Main dashboard that switches between diamonds, buyers, profile, and credits views based on user selection.",
  "frontend/src/components/dashboard/DriverDashboard.tsx": "Shows open trips and the driver’s accepted trips in two sections.",
  "frontend/src/components/dashboard/PassengerDashboard.tsx": "Shows a trip request form and the passenger’s trips panel.",
  "frontend/src/components/diamonds/DiamondPhotoPicker.tsx": "Lets users upload, preview, and remove a locally stored diamond photo.",
  "frontend/src/components/diamonds/DiamondRecordCard.tsx": "Displays a diamond record with photo, details, and a button to copy a generated summary.",
  "frontend/src/components/diamonds/DiamondRecordForm.tsx": "Form for creating a new diamond record including notes, optional details, and an optional photo.",
  "frontend/src/components/diamonds/DiamondsPanel.tsx": "Lists the user’s diamond records and provides a form to add new ones.",
  "frontend/src/components/layout/AppFooter.tsx": "Footer showing copyright info and a link to caffeine.ai.",
  "frontend/src/components/layout/AppHeader.tsx": "Top navigation bar with logo, user info, and navigation for diamonds, buyers, profile, and credits.",
  "frontend/src/components/layout/AppLayout.tsx": "App layout wrapper providing header, footer, and main content area.",
  "frontend/src/components/payouts/DriverEarningsCard.tsx": "Displays driver earnings, available balance, and recent completed trip payouts with loading states.",
  "frontend/src/components/payouts/DriverPayoutsPanel.tsx": "Wraps the earnings card, payout request form, and payout history into a single driver payouts dashboard.",
  "frontend/src/components/payouts/PayoutHistoryTable.tsx": "Shows a driver's payout request history with status badges, dates, and amounts, including loading handling.",
  "frontend/src/components/payouts/PayoutRequestForm.tsx": "Provides a form for submitting payout requests with balance validation and mutation handling.",
  "frontend/src/components/profile/ProfileForm.tsx": "Lets users view or edit their profile info with mutation-driven updates and role-based UI elements.",
  "frontend/src/components/profile/RoleSelectCard.tsx": "Guides new users through selecting a role and entering basic profile details before registration.",
  "frontend/src/components/trips/MyTripsPanel.tsx": "Displays passenger or driver trips with status, fare, locations, actions, and formatting utilities.",
  "frontend/src/components/trips/OpenTripsList.tsx": "Displays a list of open trips with pickup/dropoff details and allows drivers to accept a trip via mutation.",
  "frontend/src/components/trips/TripRequestForm.tsx": "Form for passengers to create a new trip request by entering pickup, dropoff, and fare, submitting via createTripRequest.",
  "frontend/src/components/trips/TripStatusActions.tsx": "Renders cancel or complete trip actions based on user role and trip status using cancel and complete mutations.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context using Internet Identity, managing login, identity loading, and related status flags.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profiles and trip operations, wrapping backend actor calls with caching and mutations.",
  "frontend/src/index.css": "Defines Tailwind layers, global color variables, dark mode variants, and utility component classes.",
  "frontend/src/main.tsx": "Initializes React app with React Query and Internet Identity provider, importing global styles.",
  "frontend/src/pages/CreditsPage.tsx": "Renders a styled credits page highlighting the developer and app mission with UI card components.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, persisting, and clearing URL and sessionStorage parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, radius, animations, and enabling plugins.",
  "project_state.json": "Stores project metadata, features, requirements, and image needs for the diamond‑focused app."
}